{"id":"b9f2b654-cd57-4fa8-b176-2fa01a6d2f11","rule_id":"phase3_nginx_sqli_querystring","name":"Phase3 Nginx SQLi Pattern in Query String","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":0,"updated_at":"2026-03-10T19:20:22.904Z","updated_by":"elastic","created_at":"2026-03-10T19:20:22.904Z","created_by":"elastic","enabled":true,"interval":"1m","from":"now-30d","to":"now","description":"Detect SQL injection style patterns in URL/query fields.","tags":["phase3","nginx","sqli","T1190"],"author":[],"threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":["Authorized security testing","Internal QA replaying SQLi payloads"],"references":[],"risk_score":47,"risk_score_mapping":[],"severity":"medium","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"type":"query","language":"kuery","index":["nginx-phase3-lab"],"query":"url.original : (\"/products?id=%27%20OR%201=1--\" or \"/search?q=1%20UNION%20SELECT%20username,password%20FROM%20users\" or \"/catalog?item=1%27%20AND%20SLEEP(5)--\") or url.query : (\"*UNION%20SELECT*\" or \"*SLEEP(5)*\" or \"*OR%201=1*\")"}
{"id":"b547bca4-230a-4ef5-b61f-0cb89e542581","rule_id":"phase3_nginx_webshell_path_probe","name":"Phase3 Nginx Webshell Path Probe","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":0,"updated_at":"2026-03-10T19:20:25.926Z","updated_by":"elastic","created_at":"2026-03-10T19:20:25.926Z","created_by":"elastic","enabled":true,"interval":"1m","from":"now-30d","to":"now","description":"Detect suspicious webshell and traversal-style path probes.","tags":["phase3","nginx","webshell","T1505.003"],"author":[],"threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":["Authorized red-team activity","Known scanner traffic"],"references":[],"risk_score":73,"risk_score_mapping":[],"severity":"high","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"type":"query","language":"kuery","index":["nginx-phase3-lab"],"query":"url.path : (\"*/shell.php*\" or \"*/cmd.php*\" or \"*/wp-content/uploads/*.php*\" or \"/cgi-bin/.%2e/.%2e/.%2e/bin/sh\")"}
{"id":"446393f2-43fa-4df2-abfa-4cda5574bd94","rule_id":"phase3_nginx_404_recon_burst","name":"Phase3 Nginx 404 Recon Burst","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":0,"updated_at":"2026-03-10T19:20:28.946Z","updated_by":"elastic","created_at":"2026-03-10T19:20:28.946Z","created_by":"elastic","enabled":true,"interval":"1m","from":"now-30d","to":"now","description":"Detect >=5 sensitive-path 404 probes from one source IP.","tags":["phase3","nginx","recon","T1595"],"author":[],"threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":["Known internal scanners","Authorized exposure assessments"],"references":[],"risk_score":55,"risk_score_mapping":[],"severity":"medium","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[],"type":"threshold","language":"kuery","index":["nginx-phase3-lab"],"query":"http.response.status_code: 404 and url.path : (\"/wp-admin\" or \"/wp-login.php\" or \"/.env\" or \"/phpmyadmin/\" or \"/admin/\")","threshold":{"field":["source.ip"],"value":5}}
{"exported_count":3,"exported_rules_count":3,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
